steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
#include <WiFi.h>
#include <WebServer.h>
#include <HTTPClient.h>
#include <ArduinoJson.h>
#include <Preferences.h>
#include <SPI.h>
#include <time.h>
#include <sys/time.h>
#include "esp_heap_caps.h"
#include "esp_system.h"

#include "hardware_profile.h"
#include "photopainter_core.h"
#include "queue_client_core.h"
#include "queue_runtime_types.h"
#if INKTIME_PHOTOPAINTER_ENABLED
#include "photopainter_support.h"
#include "power_manager.h"
#else
#include <GxEPD2_7C.h>
#endif
#include <HardwareSerial.h>
#include "esp_wifi.h"
#include "esp_bt.h"
#include "mbedtls/sha256.h"
#include "mbedtls/version.h"

#include "driver/gpio.h"
#include "driver/rtc_io.h"
#include "soc/soc_caps.h"

// =======================
//  正式版預設不輸出逐步序列 Log；需要除錯時以 -DINKTIME_DEBUG_LOG=1 編譯。
// =======================
#ifndef INKTIME_DEBUG_LOG
#define INKTIME_DEBUG_LOG 0
#endif
#define DEBUG_LOG INKTIME_DEBUG_LOG

HardwareSerial DebugSerial(0);

using inktime::kBoardConfig;

#if INKTIME_PHOTOPAINTER_ENABLED
inktime::PhotoPainterSupport photoPainter(kBoardConfig);
#endif

#if DEBUG_LOG
  #define DBG_BEGIN()    DebugSerial.begin(115200)
  #define DBG_PRINT(x)   DebugSerial.print(x)
  #define DBG_PRINTLN(x) DebugSerial.println(x)
#else
  #define DBG_BEGIN()
  #define DBG_PRINT(x)
  #define DBG_PRINTLN(x)
#endif

static const uint32_t FACTORY_RESET_SAMPLE_DELAY_MS = 5;

// =======================
//  AP 配置页保底：进入 AP 后 5 分钟没保存配置 -> 睡到“下一个刷新点”
// =======================
static const uint32_t AP_TIMEOUT_MS = 5UL * 60UL * 1000UL; // 5 分钟
static const uint8_t AP_MAX_SAVE_ATTEMPTS = 5;

// 實體面板固定 800x480；既有伺服器 payload 契約維持直向 480x800。
static constexpr int EPD_WIDTH  = kBoardConfig.display.width;
static constexpr int EPD_HEIGHT = kBoardConfig.display.height;
static constexpr int FB_WIDTH   = kBoardConfig.payloadWidth;
static constexpr int FB_HEIGHT  = kBoardConfig.payloadHeight;

#if !INKTIME_PHOTOPAINTER_ENABLED
GxEPD2_7C<
  INKTIME_PANEL_CLASS,
  INKTIME_PANEL_CLASS::HEIGHT / 4
> display(
  INKTIME_PANEL_CLASS(
    kBoardConfig.display.spi.cs,
    kBoardConfig.display.dc,
    kBoardConfig.display.reset,
    kBoardConfig.display.busy
  )
);
#endif

// =======================
//  舊版 URL 金鑰 API 已停用；新版透過每台裝置獨立 Bearer Token 取得 Manifest。
// =======================
#define DEVICE_MANIFEST_PATH "/api/device/v1/releases/latest"
#define DEVICE_STATUS_PATH   "/api/device/v1/status"
#define DEVICE_QUEUE_MANIFEST_PATH "/api/device/v1/queue/manifest"
#define DEVICE_QUEUE_ACK_PATH "/api/device/v1/queue/ack"
#define INKTIME_FIRMWARE_VERSION "2.5.0"

// No trusted CA provisioning exists yet. HTTPS is rejected by default instead
// of silently downgrading certificate verification. Isolated LAN HTTP remains
// supported; an explicit development override prints a warning.
#ifndef INKTIME_ALLOW_INSECURE_DEVICE_HTTP
#define INKTIME_ALLOW_INSECURE_DEVICE_HTTP 0
#endif

// =======================
//  配置存储 / WiFi / WebServer
// =======================
Preferences prefs;
WebServer  server(80);

struct Config {
  String  wifi_ssid;
  String  wifi_pass;
  String  backend_hostport;
  String  device_token;
  int32_t tz_offset_minutes;
  uint8_t refresh_hour;
  uint8_t refresh_minute;
  bool    rotate180;
  uint32_t config_version;
  bool    valid;
};

const char*  DEFAULT_HOSTPORT = "";
const int32_t DEFAULT_TZ_MINUTES = 8 * 60;
const uint8_t DEFAULT_HOUR    = 8;
const uint8_t DEFAULT_MINUTE  = 0;

Config g_cfg;
uint8_t* frameData = nullptr;
size_t frameDataSize = 0;
bool frameIndexed4 = false;
bool frameNativePalette = false;
bool serverConfigChanged = false;
bool currentPayloadShaVerified = false;
bool currentDisplaySkipped = false;
bool currentFromQueue = false;
bool currentPayloadIntegrityTrusted = false;
String portalSetupSecret;
String portalNonce;
uint8_t portalSaveAttempts = 0;
bool portalSaveAllowed = false;
String currentReleaseId;
String currentRenderProfile;
String currentPayloadSha256;
String currentQueueItemId;
int64_t currentQueueVersion = -1;
String lastDeviceErrorCode;
String lastDeviceErrorMessage;
uint32_t lastRefreshDurationMs = 0;

static int calculateSha256(const unsigned char* input, size_t length, unsigned char output[32]) {
#if MBEDTLS_VERSION_MAJOR >= 3
  return mbedtls_sha256(input, length, output, 0);
#else
  return mbedtls_sha256_ret(input, length, output, 0);
#endif
}

static bool backendTransportAllowed(const String &base) {
  if (base.startsWith("https://")) return true;
#if INKTIME_ALLOW_INSECURE_DEVICE_HTTP
  return true;
#else
  lastDeviceErrorCode = "DEVICE-HTTP-DISALLOWED";
  lastDeviceErrorMessage = "正式裝置 Backend 必須使用 HTTPS";
  return false;
#endif
}

static void configureHttpClient(HTTPClient &client, uint32_t timeoutMs) {
  client.setConnectTimeout(10000);
  client.setTimeout(timeoutMs);
  client.setFollowRedirects(HTTPC_DISABLE_FOLLOW_REDIRECTS);
}

static String randomPortalSecret() {
  char value[25];
  for (uint8_t i = 0; i < 12; ++i) snprintf(value + i * 2, 3, "%02x", static_cast<unsigned>(esp_random() & 0xff));
  return String(value);
}

static void releaseAllGpioHoldsAtBoot() {
  gpio_deep_sleep_hold_dis();
  for (int gpio = 0; gpio <= 48; ++gpio) {
    gpio_num_t gn = (gpio_num_t)gpio;
    if (!GPIO_IS_VALID_GPIO(gn)) continue;
    gpio_hold_dis(gn);
    if (rtc_gpio_is_valid_gpio(gn)) rtc_gpio_hold_dis(gn);
  }
}

static void clearConfigNVS() {
#if DEBUG_LOG
  DBG_PRINTLN("[NVS] clearConfigNVS()");
#endif
  prefs.begin("dashcfg", false);
  prefs.clear();
  prefs.end();
}

static bool isFactoryResetRequestedAtBoot() {
  if (kBoardConfig.buttons.factoryReset == inktime::kNoPin) return false;
  pinMode(
    kBoardConfig.buttons.factoryReset,
    kBoardConfig.buttons.factoryResetActiveLow ? INPUT_PULLUP : INPUT_PULLDOWN
  );
  delay(FACTORY_RESET_SAMPLE_DELAY_MS);
  const int activeLevel = kBoardConfig.buttons.factoryResetActiveLow ? LOW : HIGH;
  return digitalRead(kBoardConfig.buttons.factoryReset) == activeLevel;
}

static void saveLastTimeEpoch(time_t epoch) {
  prefs.begin("dashcfg", false);
  prefs.putULong("last_epoch", (uint32_t)epoch);
  prefs.end();
#if DEBUG_LOG
  DBG_PRINT("[TIME] save last_epoch="); DBG_PRINTLN((uint32_t)epoch);
#endif
}

static bool loadLastTimeEpoch(time_t &epochOut) {
  prefs.begin("dashcfg", true);
  uint32_t v = prefs.getULong("last_epoch", 0);
  prefs.end();
  if (v == 0) return false;
  epochOut = (time_t)v;
  return true;
}

#if INKTIME_PHOTOPAINTER_ENABLED
static bool loadLastPhotoIndex(size_t fileCount, size_t &indexOut) {
  if (fileCount == 0) return false;
  prefs.begin("dashcfg", true);
  const uint32_t value = prefs.getULong("photo_idx", UINT32_MAX);
  prefs.end();
  if (value == UINT32_MAX || value >= fileCount) return false;
  indexOut = static_cast<size_t>(value);
  return true;
}

static void saveLastPhotoIndex(size_t index) {
  prefs.begin("dashcfg", false);
  prefs.putULong("photo_idx", static_cast<uint32_t>(index));
  prefs.end();
}
#endif

static StoredDisplayRecord loadDisplayRecord() {
  prefs.begin("dashcfg", true);
  const uint8_t version = prefs.getUChar("disp_ver", 0);
  StoredDisplayRecord record = {
    prefs.getString("last_sha", ""),
    prefs.getString("last_rel", ""),
    prefs.getString("last_prof", ""),
    prefs.getString("last_board", ""),
    static_cast<int16_t>(prefs.getShort("last_rot", -1)),
    prefs.getBool("last_ok", false),
    false,
  };
  prefs.end();
  record.valid = version == 1U
    && inktime::isSha256HexValue(record.sha256.c_str())
    && record.releaseId.length() > 0U && record.releaseId.length() <= 128U
    && record.renderProfile.length() > 0U && record.renderProfile.length() <= 64U
    && record.boardProfile.length() > 0U && record.boardProfile.length() <= 96U
    && (record.rotation == 0 || record.rotation == 180);
  return record;
}

static void saveDisplayRecord(const Config &cfg, bool succeeded) {
  if (!inktime::isSha256HexValue(currentPayloadSha256.c_str())
      || currentReleaseId.length() == 0U || currentReleaseId.length() > 128U
      || currentRenderProfile.length() == 0U || currentRenderProfile.length() > 64U) {
    return;
  }
  prefs.begin("dashcfg", false);
  prefs.putUChar("disp_ver", 1U);
  prefs.putString("last_sha", currentPayloadSha256);
  prefs.putString("last_rel", currentReleaseId);
  prefs.putString("last_prof", currentRenderProfile);
  prefs.putString("last_board", kBoardConfig.name);
  prefs.putShort("last_rot", cfg.rotate180 ? 180 : 0);
  prefs.putBool("last_ok", succeeded);
  prefs.end();
}

static bool shouldSkipCurrentDisplay(const Config &cfg) {
  const StoredDisplayRecord stored = loadDisplayRecord();
#if INKTIME_PHOTOPAINTER_ENABLED
  const bool forcedRefresh = photoPainter.forceNetworkRefresh();
#else
  const bool forcedRefresh = false;
#endif
  const inktime::DisplayRecord record = {
    stored.sha256.c_str(),
    stored.releaseId.c_str(),
    stored.renderProfile.c_str(),
    stored.boardProfile.c_str(),
    stored.rotation,
    stored.succeeded,
    stored.valid,
  };
  const inktime::DisplayCandidate candidate = {
    currentPayloadSha256.c_str(),
    currentReleaseId.c_str(),
    currentRenderProfile.c_str(),
    kBoardConfig.name,
    static_cast<int16_t>(cfg.rotate180 ? 180 : 0),
    currentPayloadShaVerified,
    currentPayloadIntegrityTrusted,
    forcedRefresh,
    false,
    false,
  };
  return inktime::shouldSkipDisplay(record, candidate);
}

static PendingQueueAck loadPendingQueueAck() {
  prefs.begin("dashcfg", true);
  PendingQueueAck pending = {
    prefs.getString("ack_item", ""),
    prefs.getInt("ack_ver", -1),
    static_cast<inktime::QueueEvent>(prefs.getUChar("ack_event", 255U)),
    prefs.getBool("ack_skip", false),
    prefs.getString("ack_error", ""),
    false,
  };
  prefs.end();
  const uint8_t event = static_cast<uint8_t>(pending.event);
  pending.valid = inktime::boundedText(pending.queueItemId.c_str(), inktime::kQueueIdentifierMaxBytes)
    && pending.queueVersion >= 0 && event <= static_cast<uint8_t>(inktime::QueueEvent::DisplayFailed)
    && pending.errorCode.length() <= 64U;
  return pending;
}

static void persistPendingQueueAck(const PendingQueueAck &pending) {
  prefs.begin("dashcfg", false);
  prefs.putString("ack_item", pending.queueItemId);
  prefs.putInt("ack_ver", pending.queueVersion);
  prefs.putUChar("ack_event", static_cast<uint8_t>(pending.event));
  prefs.putBool("ack_skip", pending.displaySkipped);
  prefs.putString("ack_error", pending.errorCode);
  prefs.end();
}

static void clearPendingQueueAck() {
  prefs.begin("dashcfg", false);
  prefs.remove("ack_item");
  prefs.remove("ack_ver");
  prefs.remove("ack_event");
  prefs.remove("ack_skip");
  prefs.remove("ack_error");
  prefs.end();
}

static uint32_t minutesToNextRefreshFromLastEpoch(const Config &cfg) {
  time_t lastEpoch;
  if (!loadLastTimeEpoch(lastEpoch)) {
    return 1440;
  }

