steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
  uint32_t lastPowerCheckMs = millis();
  while (photoPainter.usbConnected()) {
    server.handleClient();
    if (millis() - lastPowerCheckMs >= 5000) {
      photoPainter.refreshPowerState();
      lastPowerCheckMs = millis();
    }
    delay(10);
  }
  server.stop();
  return true;
}
#endif

// =======================
//  WiFi 连接
// =======================
bool connectWiFi(const Config &cfg, uint32_t timeout_ms = 12000) {
#if DEBUG_LOG
  DBG_PRINTLN("[WIFI] connectWiFi()");
  DBG_PRINT("[WIFI] target ssid="); DBG_PRINTLN(cfg.wifi_ssid);
#endif

  if (cfg.wifi_ssid.isEmpty()) return false;

  WiFi.disconnect(false, false);
  WiFi.mode(WIFI_STA);

  WiFi.setSleep(true);
  WiFi.setTxPower(WIFI_POWER_8_5dBm);
  WiFi.begin(cfg.wifi_ssid.c_str(), cfg.wifi_pass.c_str());

  uint32_t start = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - start < timeout_ms) {
    delay(200);
#if DEBUG_LOG
    DBG_PRINT(".");
#endif
  }
#if DEBUG_LOG
  DBG_PRINTLN();
#endif

  bool ok = (WiFi.status() == WL_CONNECTED);

#if DEBUG_LOG
  if (ok) {
    DBG_PRINTLN("[WIFI] connected");
    DBG_PRINT("[WIFI] IP="); DBG_PRINTLN(WiFi.localIP());
  } else {
    DBG_PRINTLN("[WIFI] connect FAILED");
  }
#endif

  return ok;
}

// =======================
//  NTP 同步时间
// =======================
bool syncTime(const Config &cfg, struct tm &outLocal) {
#if DEBUG_LOG
  DBG_PRINTLN("[TIME] syncTime start");
#endif
  long offsetSec = (long)cfg.tz_offset_minutes * 60;
  configTime(offsetSec, 0, "pool.ntp.org", "time.nist.gov", "ntp.aliyun.com");

  for (int i = 0; i < 30; ++i) {
    if (getLocalTime(&outLocal)) {
#if DEBUG_LOG
      char buf[64];
      strftime(buf, sizeof(buf), "%Y-%m-%d %H:%M:%S", &outLocal);
      DBG_PRINT("[TIME] OK: "); DBG_PRINTLN(buf);
#endif
      time_t nowEpoch = time(nullptr);
      if (nowEpoch > 0) {
        saveLastTimeEpoch(nowEpoch);
#if INKTIME_PHOTOPAINTER_ENABLED
        photoPainter.writeRtc(nowEpoch);
#endif
      }
      return true;
    }
    delay(500);
  }
#if DEBUG_LOG
  DBG_PRINTLN("[TIME] syncTime FAILED");
#endif
#if INKTIME_PHOTOPAINTER_ENABLED
  time_t rtcEpoch = 0;
  if (photoPainter.readRtc(rtcEpoch)) {
    struct timeval value = {rtcEpoch, 0};
    settimeofday(&value, nullptr);
    localtime_r(&rtcEpoch, &outLocal);
    saveLastTimeEpoch(rtcEpoch);
#if DEBUG_LOG
    DBG_PRINTLN("[TIME] restored from PCF85063");
#endif
    return true;
  }
#endif
  return false;
}

static bool normalizedBackendBase(const Config &cfg, String &base) {
  base = cfg.backend_hostport;
  base.trim();
  if (!base.startsWith("http://") && !base.startsWith("https://")) base = "https://" + base;
  while (base.endsWith("/")) base.remove(base.length() - 1U);
  const int schemeEnd = base.indexOf("://");
  const String origin = schemeEnd >= 0 ? base.substring(schemeEnd + 3) : String("");
  if (origin.length() == 0U || origin.indexOf('/') >= 0 || origin.indexOf('?') >= 0
      || origin.indexOf('#') >= 0 || origin.indexOf('@') >= 0) {
    lastDeviceErrorCode = "DEVICE-BACKEND-ORIGIN";
    lastDeviceErrorMessage = "Backend 必須是不含帳密、路徑、Query 或 Fragment 的 Origin";
    return false;
  }
  return backendTransportAllowed(base);
}

static bool queueAckIdempotencyKey(const PendingQueueAck &pending, String &key) {
  char material[320];
  if (!inktime::idempotencyMaterial(
        pending.queueItemId.c_str(), pending.queueVersion, pending.event, material, sizeof(material))) {
    return false;
  }
  unsigned char digest[32];
  if (calculateSha256(
        reinterpret_cast<const unsigned char*>(material), strlen(material), digest) != 0) {
    return false;
  }
  char output[65];
  for (size_t index = 0; index < 32U; ++index) {
    snprintf(output + index * 2U, 3U, "%02x", digest[index]);
  }
  output[64] = '\0';
  key = output;
  return true;
}

static bool sendQueueAck(const Config &cfg, const PendingQueueAck &pending, bool persistFirst) {
  String base;
  if (!pending.valid || WiFi.status() != WL_CONNECTED || !normalizedBackendBase(cfg, base)) return false;
  String idempotencyKey;
  if (!queueAckIdempotencyKey(pending, idempotencyKey)) {
    lastDeviceErrorCode = "DEVICE-QUEUE-ACK-KEY";
    lastDeviceErrorMessage = "Queue ACK idempotency key 無法建立";
    return false;
  }
  if (persistFirst) persistPendingQueueAck(pending);

  JsonDocument payload;
  payload["queue_item_id"] = pending.queueItemId;
  payload["queue_version"] = pending.queueVersion;
  payload["event"] = inktime::queueEventName(pending.event);
  payload["idempotency_key"] = idempotencyKey;
  if (pending.displaySkipped) {
    payload["display_skipped"] = true;
    payload["skip_reason"] = "same_sha256";
  }
  if (pending.errorCode.length() > 0U) payload["error_code"] = pending.errorCode;
  String body;
  serializeJson(payload, body);

  for (uint8_t attempt = 0; attempt <= inktime::kQueueRetryLimit; ++attempt) {
    HTTPClient ackHttp;
    configureHttpClient(ackHttp, 15000);
    if (!ackHttp.begin(base + String(DEVICE_QUEUE_ACK_PATH))) break;
    ackHttp.addHeader("Authorization", "Bearer " + cfg.device_token);
    ackHttp.addHeader("Content-Type", "application/json");
    const int status = ackHttp.POST(body);
    ackHttp.end();
    const inktime::AckDecision decision = inktime::ackDecision(status, attempt);
    if (decision == inktime::AckDecision::Accepted) {
      clearPendingQueueAck();
      return true;
    }
    if (decision == inktime::AckDecision::StaleManifest) {
      clearPendingQueueAck();
      lastDeviceErrorCode = "DEVICE-QUEUE-STALE";
      lastDeviceErrorMessage = "QUEUE-003 Queue version 已過期；下次重新取得 Manifest";
      return false;
    }
    if (decision == inktime::AckDecision::AuthorizationFailed) {
      lastDeviceErrorCode = "DEVICE-QUEUE-AUTH";
      lastDeviceErrorMessage = "Queue ACK Token／authorization 被拒絕";
      return false;
    }
    if (decision != inktime::AckDecision::Retry) break;
    delay(250U * (attempt + 1U));
  }
  lastDeviceErrorCode = "DEVICE-QUEUE-ACK-RETRY";
  lastDeviceErrorMessage = "Queue ACK 已達有界 retry 上限；pending event 已保留";
  return false;
}

static bool sendQueueEvent(
  const Config &cfg,
  inktime::QueueEvent event,
  bool displaySkipped = false,
  const String &errorCode = String("")
) {
  PendingQueueAck pending = {
    currentQueueItemId,
    static_cast<int32_t>(currentQueueVersion),
    event,
    displaySkipped,
    errorCode.substring(0, 64),
    currentQueueItemId.length() > 0U && currentQueueVersion >= 0,
  };
  return sendQueueAck(cfg, pending, true);
}

