steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
    String fileUrl = base + String(downloadBaseRaw) + fileName;
    HTTPClient fileHttp;
    configureHttpClient(fileHttp, 60000);
    const char* fileHeaders[] = {"Content-Type"};
    fileHttp.collectHeaders(fileHeaders, 1);
    if (!fileHttp.begin(fileUrl)) continue;
    fileHttp.addHeader("Authorization", "Bearer " + cfg.device_token);
    int code = fileHttp.GET();
    const String fileContentType = fileHttp.header("Content-Type");
    if (code != HTTP_CODE_OK || fileHttp.getSize() != (int)packedSize
        || !fileContentType.startsWith("application/octet-stream")) {
      fileHttp.end();
      continue;
    }

    WiFiClient *stream = fileHttp.getStreamPtr();
    size_t total = 0;
    uint32_t started = millis();
    while (total < packedSize && millis() - started < 60000) {
      size_t available = stream->available();
      if (!available) {
        if (!fileHttp.connected()) break;
        delay(1);
        continue;
      }
      size_t count = min(available, packedSize - total);
      int received = stream->read(packed + total, count);
      if (received > 0) total += received;
    }
    fileHttp.end();
    if (total != packedSize) continue;

    unsigned char digest[32];
    if (calculateSha256(packed, packedSize, digest) != 0) continue;
    char actualSha[65];
    for (int i = 0; i < 32; ++i) sprintf(actualSha + i * 2, "%02x", digest[i]);
    actualSha[64] = '\0';
    if (!expectedSha.equalsIgnoreCase(String(actualSha))) continue;
    currentPayloadShaVerified = true;
    currentPayloadIntegrityTrusted = true;
    currentPayloadSha256 = expectedSha;

    // 完整下載與 SHA-256 都通過後才替換資料。
    if (frameData) heap_caps_free(frameData);
#if INKTIME_PHOTOPAINTER_ENABLED
    uint8_t* nativeFrame = nullptr;
    if (!photoPainter.convertAndCache(
          packed,
          packedSize,
          indexed4,
          sourceHash,
          rotation,
          &nativeFrame)) {
      frameData = nullptr;
      lastDeviceErrorCode = photoPainter.lastError();
      lastDeviceErrorMessage = "PhotoPainter framebuffer 轉換失敗";
      continue;
    }
    heap_caps_free(packed);
    frameData = nativeFrame;
    frameDataSize = inktime::kPhotoPainterFrameBytes;
    frameIndexed4 = true;
    frameNativePalette = true;
#else
    frameData = packed;
    frameDataSize = packedSize;
    frameIndexed4 = indexed4;
    frameNativePalette = false;
#endif
    currentReleaseId = manifest["release_id"] | "";
    currentRenderProfile = renderProfile;
#if INKTIME_PHOTOPAINTER_ENABLED
    saveLastPhotoIndex(fileIndex);
#endif
    return true;
  }

  heap_caps_free(packed);
  lastDeviceErrorCode = "DEVICE-DOWNLOAD";
  lastDeviceErrorMessage = "所有發布檔案下載或 SHA-256 校驗失敗";
  return false;
}

static QueueDownloadResult downloadQueuePhotoBin(Config &cfg) {
  String base;
  if (!normalizedBackendBase(cfg, base)) return QueueDownloadResult::Failed;

  HTTPClient manifestHttp;
  configureHttpClient(manifestHttp, 30000);
  const char* manifestHeaders[] = {"Content-Type"};
  manifestHttp.collectHeaders(manifestHeaders, 1);
  if (!manifestHttp.begin(base + String(DEVICE_QUEUE_MANIFEST_PATH))) {
    lastDeviceErrorCode = "DEVICE-QUEUE-URL";
    lastDeviceErrorMessage = "Queue Manifest URL 無法初始化";
    return QueueDownloadResult::Failed;
  }
  manifestHttp.addHeader("Authorization", "Bearer " + cfg.device_token);
  const int status = manifestHttp.GET();
  if (status == HTTP_CODE_NOT_FOUND) {
    manifestHttp.end();
    return QueueDownloadResult::EmptyOrUnsupported;
  }
  const int manifestLength = manifestHttp.getSize();
  const String contentType = manifestHttp.header("Content-Type");
  if (status != HTTP_CODE_OK || manifestLength <= 0
      || manifestLength > static_cast<int>(inktime::kQueueManifestMaxBytes)
      || !contentType.startsWith("application/json")) {
    manifestHttp.end();
    lastDeviceErrorCode = "DEVICE-QUEUE-HTTP";
    lastDeviceErrorMessage = "Queue Manifest HTTP／Content-Type／長度不合法";
    return QueueDownloadResult::Failed;
  }

  JsonDocument manifest;
  const DeserializationError jsonError = deserializeJson(manifest, manifestHttp.getStream());
  manifestHttp.end();
  const JsonVariantConst schema = manifest["schema_version"];
  const JsonVariantConst version = manifest["queue_version"];
  const JsonVariantConst rawItems = manifest["items"];
  if (jsonError || manifest.overflowed() || !schema.is<int32_t>() || schema.is<bool>()
      || schema.as<int32_t>() != 1 || !version.is<int32_t>() || version.is<bool>()
      || version.as<int32_t>() < 0 || !rawItems.is<JsonArrayConst>()) {
    lastDeviceErrorCode = "DEVICE-QUEUE-SCHEMA";
    lastDeviceErrorMessage = "Queue Manifest schema、version 或 items 不合法";
    return QueueDownloadResult::Failed;
  }
  const JsonArrayConst items = rawItems.as<JsonArrayConst>();
  if (items.size() == 0U) return QueueDownloadResult::EmptyOrUnsupported;
  if (items.size() > 14U) {
    lastDeviceErrorCode = "DEVICE-QUEUE-COUNT";
    lastDeviceErrorMessage = "Queue Item 數量超過裝置上限";
    return QueueDownloadResult::Failed;
  }

  String selectedItemId;
  String selectedReleaseId;
  String selectedSha;
  String selectedDownloadUrl;
  String selectedPixelFormat;
  String selectedRenderProfile;
  int64_t selectedSize = 0;
  for (size_t index = 0; index < items.size(); ++index) {
    const JsonVariantConst rawItem = items[index];
    if (!rawItem.is<JsonObjectConst>()) {
      lastDeviceErrorCode = "DEVICE-QUEUE-ITEM";
      lastDeviceErrorMessage = "Queue Item 必須是 JSON object";
      return QueueDownloadResult::Failed;
    }
    const JsonObjectConst item = rawItem.as<JsonObjectConst>();
    const JsonVariantConst rawSize = item["size"];
    const JsonVariantConst rawWidth = item["width"];
    const JsonVariantConst rawHeight = item["height"];
    if (!rawSize.is<int64_t>() || rawSize.is<bool>() || !rawWidth.is<int32_t>()
        || rawWidth.is<bool>() || !rawHeight.is<int32_t>() || rawHeight.is<bool>()) {
      lastDeviceErrorCode = "DEVICE-QUEUE-INTEGER";
      lastDeviceErrorMessage = "Queue size／width／height 必須是真正 JSON integer";
      return QueueDownloadResult::Failed;
    }
    String itemId = item["queue_item_id"] | "";
    String releaseId = item["release_id"] | "";
    String sha = item["sha256"] | "";
    String downloadUrl = item["download_url"] | "";
    String pixelFormat = item["pixel_format"] | "";
    String renderProfile = item["render_profile"] | "";
    const int64_t size = rawSize.as<int64_t>();
    const inktime::QueueItemContract contract = {
      itemId.c_str(), releaseId.c_str(), sha.c_str(), downloadUrl.c_str(), true, size,
    };
    const bool compatibleProfile = renderProfile == "safe_4c"
      || renderProfile == String(INKTIME_PANEL_PROFILE);
    if (!inktime::validQueueItem(contract) || rawWidth.as<int32_t>() != FB_WIDTH
        || rawHeight.as<int32_t>() != FB_HEIGHT
        || (pixelFormat != "2bpp" && pixelFormat != "indexed4")
        || !compatibleProfile) {
      lastDeviceErrorCode = "DEVICE-QUEUE-ITEM";
      lastDeviceErrorMessage = "Queue Item 身分、SHA、路徑、尺寸或 Profile 不合法";
      return QueueDownloadResult::Failed;
    }
    if (index == 0U) {
      selectedItemId = itemId;
      selectedReleaseId = releaseId;
      selectedSha = sha;
      selectedDownloadUrl = downloadUrl;
      selectedPixelFormat = pixelFormat;
      selectedRenderProfile = renderProfile;
      selectedSize = size;
    }
  }

  currentFromQueue = true;
  currentQueueItemId = selectedItemId;
  currentQueueVersion = version.as<int32_t>();
  currentReleaseId = selectedReleaseId;
  currentRenderProfile = selectedRenderProfile;
  currentPayloadSha256 = selectedSha;
  currentPayloadShaVerified = false;
  currentPayloadIntegrityTrusted = false;
  currentDisplaySkipped = false;
  if (!sendQueueEvent(cfg, inktime::QueueEvent::ManifestReceived)) {
    return QueueDownloadResult::Failed;
  }

