steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
  const bool indexed4 = selectedPixelFormat == "indexed4";
  const size_t packedSize = static_cast<size_t>(FB_WIDTH) * FB_HEIGHT / (indexed4 ? 2U : 4U);
  if (selectedSize != static_cast<int64_t>(packedSize)) {
    lastDeviceErrorCode = "DEVICE-QUEUE-SIZE";
    lastDeviceErrorMessage = "Queue Payload size 與 pixel format 不一致";
    return QueueDownloadResult::Failed;
  }

  uint8_t* packed = nullptr;
#if INKTIME_PHOTOPAINTER_ENABLED
  packed = photoPainter.allocateWireBuffer(packedSize);
#else
  packed = static_cast<uint8_t*>(heap_caps_malloc(packedSize, MALLOC_CAP_8BIT | MALLOC_CAP_SPIRAM));
  if (!packed) packed = static_cast<uint8_t*>(heap_caps_malloc(packedSize, MALLOC_CAP_8BIT));
#endif
  if (!packed) {
    lastDeviceErrorCode = "DEVICE-MEMORY";
    lastDeviceErrorMessage = "無法配置 Queue 下載緩衝區";
    return QueueDownloadResult::Failed;
  }
  if (!sendQueueEvent(cfg, inktime::QueueEvent::DownloadStarted)) {
    heap_caps_free(packed);
    return QueueDownloadResult::Failed;
  }

  HTTPClient fileHttp;
  configureHttpClient(fileHttp, 60000);
  const char* fileHeaders[] = {"Content-Type"};
  fileHttp.collectHeaders(fileHeaders, 1);
  if (!fileHttp.begin(base + selectedDownloadUrl)) {
    heap_caps_free(packed);
    lastDeviceErrorCode = "DEVICE-QUEUE-FILE-URL";
    lastDeviceErrorMessage = "Queue download URL 無法初始化";
    return QueueDownloadResult::Failed;
  }
  fileHttp.addHeader("Authorization", "Bearer " + cfg.device_token);
  const int fileStatus = fileHttp.GET();
  const String fileContentType = fileHttp.header("Content-Type");
  if (fileStatus != HTTP_CODE_OK || fileHttp.getSize() != static_cast<int>(packedSize)
      || !fileContentType.startsWith("application/octet-stream")) {
    fileHttp.end();
    heap_caps_free(packed);
    lastDeviceErrorCode = "DEVICE-QUEUE-DOWNLOAD";
    lastDeviceErrorMessage = "Queue download HTTP／Content-Type／長度不合法";
    return QueueDownloadResult::Failed;
  }
  WiFiClient* stream = fileHttp.getStreamPtr();
  size_t total = 0U;
  const uint32_t started = millis();
  while (total < packedSize && millis() - started < 60000U) {
    const size_t available = stream->available();
    if (available == 0U) {
      if (!fileHttp.connected()) break;
      delay(1);
      continue;
    }
    const size_t count = min(available, packedSize - total);
    const int received = stream->read(packed + total, count);
    if (received > 0) total += static_cast<size_t>(received);
  }
  fileHttp.end();
  if (total != packedSize) {
    heap_caps_free(packed);
    lastDeviceErrorCode = "DEVICE-QUEUE-DOWNLOAD";
    lastDeviceErrorMessage = "Queue Payload 未完整下載";
    return QueueDownloadResult::Failed;
  }
  if (!sendQueueEvent(cfg, inktime::QueueEvent::DownloadCompleted)) {
    heap_caps_free(packed);
    return QueueDownloadResult::Failed;
  }

  unsigned char digest[32];
  if (calculateSha256(packed, packedSize, digest) != 0) {
    heap_caps_free(packed);
    lastDeviceErrorCode = "DEVICE-QUEUE-HASH";
    lastDeviceErrorMessage = "Queue Payload SHA-256 計算失敗";
    return QueueDownloadResult::Failed;
  }
  char actualSha[65];
  for (size_t index = 0; index < 32U; ++index) {
    snprintf(actualSha + index * 2U, 3U, "%02x", digest[index]);
  }
  actualSha[64] = '\0';
  if (!selectedSha.equalsIgnoreCase(String(actualSha))) {
    heap_caps_free(packed);
    lastDeviceErrorCode = "DEVICE-QUEUE-HASH";
    lastDeviceErrorMessage = "Queue Payload SHA-256 不一致";
    return QueueDownloadResult::Failed;
  }
  currentPayloadShaVerified = true;
  if (!sendQueueEvent(cfg, inktime::QueueEvent::HashVerified)) {
    heap_caps_free(packed);
    return QueueDownloadResult::Failed;
  }

  if (frameData) heap_caps_free(frameData);
#if INKTIME_PHOTOPAINTER_ENABLED
  const uint32_t sourceHash = inktime::sourceHash32(selectedSha.c_str());
  const inktime::DisplayRotation rotation = cfg.rotate180
    ? inktime::DisplayRotation::Rotate180
    : inktime::DisplayRotation::Rotate0;
  uint8_t* nativeFrame = nullptr;
  if (!photoPainter.loadCachedFrame(sourceHash, rotation, &nativeFrame)
      && !photoPainter.convertAndCache(
        packed, packedSize, indexed4, sourceHash, rotation, &nativeFrame)) {
    heap_caps_free(packed);
    frameData = nullptr;
    lastDeviceErrorCode = photoPainter.lastError();
    lastDeviceErrorMessage = "PhotoPainter Queue framebuffer 轉換失敗";
    return QueueDownloadResult::Failed;
  }
  heap_caps_free(packed);
  frameData = nativeFrame;
  frameDataSize = inktime::kPhotoPainterFrameBytes;
  frameIndexed4 = true;
  frameNativePalette = true;
#else
  frameData = packed;
  frameDataSize = packedSize;
  frameIndexed4 = indexed4;
  frameNativePalette = false;
#endif
  currentPayloadIntegrityTrusted = true;
  currentDisplaySkipped = shouldSkipCurrentDisplay(cfg);
  return QueueDownloadResult::Used;
}

bool downloadDailyPhotoBin(Config &cfg) {
  if (!resumePendingQueueAck(cfg)) return false;
  const QueueDownloadResult queueResult = downloadQueuePhotoBin(cfg);
  if (queueResult == QueueDownloadResult::Used) return true;
  if (queueResult == QueueDownloadResult::Failed) {
    if (currentFromQueue && !loadPendingQueueAck().valid) {
      sendQueueEvent(cfg, inktime::QueueEvent::DisplayFailed, false, lastDeviceErrorCode);
    }
    return false;
  }
  const bool latest = downloadLatestPhotoBin(cfg);
  if (latest) currentDisplaySkipped = shouldSkipCurrentDisplay(cfg);
  return latest;
}

void reportDeviceStatus(const Config &cfg, bool displayUpdated) {
  if (WiFi.status() != WL_CONNECTED || cfg.backend_hostport.length() == 0 || cfg.device_token.length() == 0) return;
  String base;
  if (!normalizedBackendBase(cfg, base)) return;

#if INKTIME_PHOTOPAINTER_ENABLED
  photoPainter.readEnvironment();
#endif
  JsonDocument payload;
  payload["firmware_version"] = INKTIME_FIRMWARE_VERSION;
  payload["board_profile"] = kBoardConfig.name;
  payload["wifi_rssi"] = WiFi.RSSI();
  payload["free_heap_bytes"] = ESP.getFreeHeap();
  payload["free_psram_bytes"] = ESP.getFreePsram();
  payload["wake_reason"] = String((int)esp_sleep_get_wakeup_cause());
  payload["display_updated"] = displayUpdated;
  payload["display_skipped"] = currentDisplaySkipped;
  if (currentDisplaySkipped) payload["display_skip_reason"] = "same_sha256";
  payload["payload_sha256_verified"] = currentPayloadShaVerified;
  payload["applied_config_version"] = cfg.config_version;
  payload["panel_profile"] = INKTIME_PANEL_PROFILE;
  payload["render_profile"] = currentRenderProfile;
  payload["release_id"] = currentReleaseId;
  payload["error_code"] = lastDeviceErrorCode;
  payload["error_message"] = lastDeviceErrorMessage;
#if INKTIME_ALLOW_INSECURE_DEVICE_HTTP
  payload["transport_profile"] = "trusted-lan-http";
  payload["transport_security_state"] = "degraded";
  payload["transport_warning"] = "no_tls";
#else
  payload["transport_profile"] = "https-only";
  payload["transport_security_state"] = "secure-required";
#endif
#if INKTIME_PHOTOPAINTER_ENABLED
  payload["flash_bytes"] = ESP.getFlashChipSize();
  payload["psram_bytes"] = ESP.getPsramSize();
  payload["flash_ready"] = photoPainter.flashReady();
  payload["psram_ready"] = photoPainter.psramReady();
  payload["sd_card"] = photoPainter.sdReady();
  payload["rtc"] = photoPainter.rtcReady();
  payload["cache_status"] = inktime::cacheStatusName(photoPainter.cacheStatus());
  payload["pmic_type"] = inktime::pmicTypeName(photoPainter.pmicType());
  payload["usb_power"] = photoPainter.usbConnected();
  if (photoPainter.batteryVoltage() > 0.0f) {
    payload["battery_voltage"] = photoPainter.batteryVoltage();
  }
  if (photoPainter.batteryPercent() >= 0) {
    payload["battery_percent"] = photoPainter.batteryPercent();
    payload["battery_percent_estimated"] = true;
  }
  if (photoPainter.environmentValid()) {
    payload["temperature_c"] = photoPainter.temperatureC();
    payload["humidity_percent"] = photoPainter.humidityPercent();
  }
  payload["button_wakeup"] = photoPainter.wokeFromUserButton();
#endif
  payload["last_refresh_duration_ms"] = lastRefreshDurationMs;
  payload["wake_duration_ms"] = millis();
  String body;
  serializeJson(payload, body);

  HTTPClient statusHttp;
  configureHttpClient(statusHttp, 15000);
  if (!statusHttp.begin(base + String(DEVICE_STATUS_PATH))) return;
  statusHttp.addHeader("Authorization", "Bearer " + cfg.device_token);
  statusHttp.addHeader("Content-Type", "application/json");
  statusHttp.POST(body);
  statusHttp.end();
}

// =======================
//  墨水屏显示
// =======================
void initDisplay(const Config &cfg) {
#if INKTIME_PHOTOPAINTER_ENABLED
  (void)cfg;
#else
#if DEBUG_LOG
  DBG_PRINTLN("[EPD] initDisplay");
#endif
  SPI.end();
  SPI.begin(
    kBoardConfig.display.spi.sck,
    kBoardConfig.display.spi.miso,
    kBoardConfig.display.spi.mosi,
    kBoardConfig.display.spi.cs
  );

  display.init(0, true, 2, false);

  if (cfg.rotate180) display.setRotation(3);
  else              display.setRotation(1);
#endif
}

bool drawFromFrameData(const Config &cfg) {
  (void)cfg;

#if INKTIME_PHOTOPAINTER_ENABLED
  if (!frameNativePalette || frameDataSize != inktime::kPhotoPainterFrameBytes) return false;
  const bool updated = photoPainter.displayFrame(frameData, frameDataSize);
  lastRefreshDurationMs = photoPainter.lastRefreshDurationMs();
  return updated;
#else

  const uint32_t refreshStarted = millis();
  display.setFullWindow();
  int w = display.width();   // 480
  int h = display.height();  // 800

#if DEBUG_LOG
  DBG_PRINT("[EPD] logical w="); DBG_PRINT(w);
  DBG_PRINT(" h="); DBG_PRINTLN(h);
#endif

